import {
  Tabs,
  TabList,
  TabPanels,
  Tab,
  TabPanel,
} from "@chakra-ui/react";

const TabsCourses = () => {
  return (
    <Tabs colorScheme="red" align="center">
      <TabList>
        <Tab fontWeight="bold">Берлин</Tab>
        <Tab fontWeight="bold">Франкфурт</Tab>
        <Tab fontWeight="bold">Гамбург</Tab>
        <Tab fontWeight="bold">Кёльн</Tab>
        <Tab fontWeight="bold">Мюнхен</Tab>
        <Tab fontWeight="bold">Лейпциг</Tab>
        <Tab fontWeight="bold">Дрезден</Tab>
        <Tab fontWeight="bold">Нюрнберг</Tab>
        <Tab fontWeight="bold">Бремен</Tab>
      </TabList>
      <TabPanels>
        <TabPanel>
          <p>
            Did deutsch-institutdid означает deutsch in deutschland (немецкий в
            Германии), и со времени основания компании в 1970 году это остается
            ее девизом. Школа специализируется исключительно на преподавании
            немецкого языка и не сомневается, что немецкий проще учить там, где
            на нем разговаривают.
            <br />
            <br />
            Humboldt-InstitutHumboldt-Institut крупная языковая школа Германии
            открытая в 1977 году. Предлагает курсы немецкого языка для детей,
            подростков, взрослых круглый год. Также занимается частными
            школами-пансионами элитного сегмента по всей Германии.
            <br />
            <br />
            Sprachenatelier BerlinЯзыковая школа Германии, расположенная в
            Берлине в замечательном здании, которое является памятником
            архитектуры. Ресторан, расположенный на первом этаже здания
            дополняет девиз школы и является идеальным к их предложению: язык,
            искусство, культура и кухня!
            <br />
            <br />
            BWS GermanlinguaШкола, основанная в 1984 году, предлагает разнообразные курсы (интенсивное, индивидуальное и гибридное образование) немецкого языка в центрах самых привлекательных городов Германии: Мюнхен, Кёльн и Берлин. Группы небольшие (до 12 человек) или мини группы (до 6 человек).
            <br />
            <br />
            EURASIA Institute GermanyОснованный в Берлине в 1993 году Институт международного образования Eurasia стремиться предоставить своим студентам среду, в которой они могут развивать свои таланты, страсти и реализовывать свои мечты.
            <br />
            <br />
            Sprachenakademie BerlinНебольшая языковая школа в Берлине. Школа предлагает невысокие цены обучения, различные варианты курсов для любых уровней знания немецкого языка (от А1 до С2) в небольших группах. Интенсивные курсы, подготовительные к экзаменам или частные уроки - ваш выбор!
          </p>
        </TabPanel>
        <TabPanel>
          <p>
            did deutsch-institutdid означает deutsch in deutschland (немецкий в
            Германии), и со времени основания компании в 1970 году это остается
            ее девизом. Школа специализируется исключительно на преподавании
            немецкого языка и не сомневается, что немецкий проще учить там, где
            на нем разговаривают.
          </p>
        </TabPanel>
        <TabPanel>
          <p>
            did deutsch-institutdid означает deutsch in deutschland (немецкий в
            Германии), и со времени основания компании в 1970 году это остается
            ее девизом. Школа специализируется исключительно на преподавании
            немецкого языка и не сомневается, что немецкий проще учить там, где
            на нем разговаривают.
          </p>
        </TabPanel>
        <TabPanel>
          <p>
          interDaF — школа, основанная в 1992 году при университет Лейпцига, предоставляет иностранным абитуриентам, которые хотят учиться в немецкогоязычной стране, необходимые навыки и знакомит их с культурной, исторической и современной жизнью Германии различными способами.
          </p>
        </TabPanel>
        <TabPanel>
          <p>
          Carl DuisbergМиссией школы уже более 50 лет является продвижение взаимопонимания различных культур по всему миру. Основными ценностями школы являются объединение людей, культур и стран; помощь людям в достижении общих целей; высокие стандарты.
          <br />
            <br />
            BWS GermanlinguaШкола, основанная в 1984 году, предлагает разнообразные курсы (интенсивное, индивидуальное и гибридное образование) немецкого языка в центрах самых привлекательных городов Германии: Мюнхен, Кёльн и Берлин. Группы небольшие (до 12 человек) или мини группы (до 6 человек).
          </p>
        </TabPanel>
        <TabPanel>
          <p>
            Did deutsch-institutdid — означает deutsch in deutschland (немецкий
            в Германии), и со времени основания компании в 1970 году это
            остается ее девизом. Школа специализируется исключительно на
            преподавании немецкого языка и не сомневается, что немецкий проще
            учить там, где на нем разговаривают.
            <br />
            <br />
            TANDEM — языковая школа Германии, расположенная в Мюнхене, которая
            более 30 лет обучает немецкому языку людей со всего мира. Школа
            предлагает различные вариант программ: интенсивное обучение, летние
            курсы, вечерние курсы, подготовка к экзаменам и многое другое.
            <br />
            <br />
            Carl Duisberg. Миссией школы уже более 50 лет является продвижение
            взаимопонимания различных культур по всему миру. Основными
            ценностями школы являются объединение людей, культур и стран; помощь
            людям в достижении общих целей; высокие стандарты.
            <br />
            <br />
            BWS Germanlingua. Школа, основанная в 1984 году, предлагает
            разнообразные курсы (интенсивное, индивидуальное и гибридное
            образование) немецкого языка в центрах самых привлекательных городов
            Германии: Мюнхен, Кёльн и Берлин. Группы небольшие (до 12 человек)
            или мини группы (до 6 человек).
          </p>
        </TabPanel>
        <TabPanel>
          <p>
          Kästner KollegKästner Kolleg - одна из лидирующих школ немецкого языка в Германии. Школа предлагает курсы различных форматов для всех: интенсивные или несколько раз в неделю, индивидуальные, подготовка к экзамену, вечерние и даже онлайн курсы.
          </p>
        </TabPanel>
        <TabPanel>
          <p>
          Primus Fremdsprachen — небольшая языковая школа Германии предлагает широкий спектр курсов немецкого языка с опытными преподавателями, которые внимательно и с уважением относятся к вашим нуждам и запросам и составляют программы с учётом ваших интересов.
          </p>
        </TabPanel>
        <TabPanel>
          <p>
          Sprachschule AKTIV — языковая школа Германии, расположенная в Бремене. Школа предлагает различные вариант программ, такие как интенсивное обучение, вечерние курсы, индивидуальное обучение, а также подготовку к языковым экзаменам для всех уровней от А1 до С2.
          </p>
        </TabPanel>
      </TabPanels>
    </Tabs>
  );
};

export default TabsCourses;
